// @strict-types

#Область ПрограммныйИнтерфейс

Процедура ПерейтиНаВерсию_1_0_4_3() Экспорт
	
	АдминистраторПодсистемыБоты = Справочники.ПрофилиГруппДоступа.АдминистраторПодсистемыБоты.ПолучитьОбъект();
	АдминистраторПодсистемыБоты.Роли.Очистить();
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "ПросмотрПодсистемыБоты");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеАдресаПубликацииИнформационнойБазыДляБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВложенностиКнопокМеню");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВыполненияЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеИдентификаторовОбновленийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКомандБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеОткрытыхМенюПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеРегистрацииПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСообщенийПользователейБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияТиповСообщенийБотовМетодовИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеШаговВыполненияЗаданий");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПланаВидовХарактеристикПредопределенныеЗначения");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияПользователейСистем");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПользовательскихФункций");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеНастроекИнтеграции");
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(АдминистраторПодсистемыБоты);
	
КонецПроцедуры

Процедура ПерейтиНаВерсию_1_0_4_5() Экспорт
	
	АдминистраторПодсистемыБоты = Справочники.ПрофилиГруппДоступа.АдминистраторПодсистемыБоты.ПолучитьОбъект();
	АдминистраторПодсистемыБоты.Роли.Очистить();
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "ПросмотрПодсистемыБоты");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеАдресаПубликацииИнформационнойБазыДляБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВложенностиКнопокМеню");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВыполненияЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеИдентификаторовОбновленийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКомандБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеОткрытыхМенюПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеРегистрацииПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСообщенийПользователейБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияТиповСообщенийБотовМетодовИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеШаговВыполненияЗаданий");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПланаВидовХарактеристикПредопределенныеЗначения");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияПользователейСистем");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПользовательскихФункций");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеНастроекИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеУчастниковВидеоЧатов");
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(АдминистраторПодсистемыБоты);
	
КонецПроцедуры

Процедура ПерейтиНаВерсию_1_0_4_6() Экспорт
	
	АдминистраторПодсистемыБоты = Справочники.ПрофилиГруппДоступа.АдминистраторПодсистемыБоты.ПолучитьОбъект();
	АдминистраторПодсистемыБоты.Роли.Очистить();
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "ПросмотрПодсистемыБоты");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеАдресаПубликацииИнформационнойБазыДляБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВложенностиКнопокМеню");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеВыполненияЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеИдентификаторовОбновленийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКомандБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеОткрытыхМенюПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеРегистрацииПользователейБота");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСообщенийПользователейБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияТиповСообщенийБотовМетодовИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеШаговВыполненияЗаданий");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПланаВидовХарактеристикПредопределенныеЗначения");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеСоответствияПользователейСистем");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеПользовательскихФункций");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеНастроекИнтеграции");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеУчастниковВидеоЧатов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "ПросмотрФормыНастроекПодсистемыБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКоличествоДнейХраненияВыполненияЗаданийБотов");
	
	СтрокаРоли = АдминистраторПодсистемыБоты.Роли.Добавить();
	СтрокаРоли.Роль = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(
		"Имя", "РедактированиеКоличествоДнейХраненияСообщенийБотов");
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(АдминистраторПодсистемыБоты);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс