

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(); 
	Объект.ДатаНачала = ТекущаяДата();
	ЗаполнитьНаставника(); 
	СформироватьТабличныйДокументПлана();
	Период.ДатаНачала = Объект.ДатаНачала;
	Период.ДатаОкончания = Объект.ДатаОкончания;

КонецПроцедуры    

&НаСервере
Процедура УстановитьВидимостьДоступность();	    
	Если Пользователи.РолиДоступны("ИзменениеДокументовИПР") Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
	ИначеЕсли Пользователи.РолиДоступны("ИзменениеДатыДокументовИПР") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина; 
		Элементы.Период.ТолькоПросмотр = Ложь;
		Элементы.Дата.ТолькоПросмотр = Ложь;
		Элементы.ПланГрафикФактическоеВремя.ТолькоПросмотр = Ложь;
	Иначе
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
 
КонецПроцедуры     


&НаСервере
Процедура ЗаполнитьНаставника()

	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Объект.Наставник = КадровыйУчетСервер.ПолучитьАктивныхНаставниковСотрудника(Объект.ДатаНачала, Объект.Сотрудник);
		
		Если ЗначениеЗаполнено(Объект.Наставник) Тогда
			Элементы.Наставник.Видимость	= Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолжность(Сотрудник, Период)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КадроваяИнформацияСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.КадроваяИнформация.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК КадроваяИнформацияСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Объект.Должность = ВыборкаДетальныеЗаписи.Должность;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ЗаполнитьНаставника();
	ЗаполнитьДолжность(Объект.Сотрудник, Объект.ДатаНачала);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ЗаполнитьНаставника();
	ЗаполнитьДолжность(Объект.Сотрудник, Объект.ДатаНачала);

КонецПроцедуры

&НаКлиенте
Процедура НаставникПриИзменении(Элемент)
	Объект.Сотрудник = Неопределено;
КонецПроцедуры  

&НаСервере
Процедура СформироватьТабличныйДокументПлана()
	
	ПланГрафикТабличныйДокумент.Очистить();
	
	// Создаём шапку
	Макет = Документы.ИндивидуальныйПланРазвития.ПолучитьМакет("МакетПланаГрафика");
	ОбластьШапки = Макет.ПолучитьОбласть("ОбластьШапка");
	//ПланГрафикТабличныйДокумент.Вывести(ОбластьШапки);
	Тз = Новый ТаблицаЗначений;
	
	Тз = Объект.ПланГрафик.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.ДатаНачала КАК ДатаНачала,
	|	ТЗ.ЗаданиеИПР КАК ЗаданиеИПР,
	|	ТЗ.Комментарий КАК Комментарий,
	|	ТЗ.ПлановоеВремя КАК ПлановоеВремя,
	|	ТЗ.Статус КАК Статус,
	|	ТЗ.ФактическоеВремя КАК ФактическоеВремя
	|ПОМЕСТИТЬ ВТ_ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЗ.ДатаНачала КАК ДатаНачала,
	|	ВТ_ТЗ.ЗаданиеИПР КАК Задание,
	|	ВТ_ТЗ.Комментарий КАК Комментарий,
	|	ВТ_ТЗ.ПлановоеВремя КАК ПланВремя,
	|	ВТ_ТЗ.Статус КАК Статус,
	|	ВТ_ТЗ.ФактическоеВремя КАК ФактВремя,
	|	ВТ_ТЗ.ЗаданиеИПР.Родитель КАК Блок
	|ИЗ
	|	ВТ_ТЗ КАК ВТ_ТЗ
	|ИТОГИ ПО
	|	Блок";
	
	Запрос.УстановитьПараметр("ТЗ", Тз);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтоги.Следующий() Цикл
		Выборка = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Выборка.Следующий();
		Область = Макет.ПолучитьОбласть("ОбластьСтрока");
		Область.Параметры.БлокЗадания = Выборка.Блок;
		Выборка.Сбросить();
		ПланГрафикТабличныйДокумент.Вывести(ОбластьШапки);
		Пока Выборка.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка);
			Область.Параметры.ДатаНачала = Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yyyy");
			ПланГрафикТабличныйДокумент.Вывести(Область);
			Если Выборка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоНеудовлетворительно") ИЛИ 
				Выборка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоУдовлетворительно") Тогда
				ПланГрафикТабличныйДокумент.Область("ОбластьСтрока").ЦветФона = WebЦвета.БледноЗеленый;
			Иначе
				ПланГрафикТабличныйДокумент.Область("ОбластьСтрока").ЦветФона = WebЦвета.Белый;
			КонецЕсли;
			
			Область.Параметры.БлокЗадания = Неопределено;
			
		КонецЦикла;
		Область = Макет.ПолучитьОбласть("ОбластьПропуск");
		ПланГрафикТабличныйДокумент.Вывести(Область);
	КонецЦикла;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПланГрафикПриИзменении(Элемент)
	СформироватьТабличныйДокументПлана();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПланГрафикЗаданиеИПРПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПланГрафик.ТекущиеДанные;       
	ТекДанные.ПлановоеВремя = ПолучитьЗначениеРеквизита(ТекДанные.ЗаданиеИПР, "ПлановыйТайминг");
    ТекДанные.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.НеПриступалКЗаданию");
	ЗаполнитьБлокиПланГрафика();

КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(Реквизит, Имя)
	
	  Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизит, Имя);  
	  
КонецФункции

&НаКлиенте
Процедура ПодборЗадач(Команда)
	ПутьКФорме = "Справочник.ЗадачиИПР.ФормаВыбора";

    ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
    ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);  
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);

    ПараметрыОткрытия.Вставить("Отбор", Новый Структура("ЭтоГруппа", Ложь));

    // Назначаем обработчик события выбора
    ОткрытьФорму(ПутьКФорме, ПараметрыОткрытия, ЭтаФорма, , , , Новый ОписаниеОповещения("ПриВыбореЗадачИПР", ЭтотОбъект));
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриВыбореЗадачИПР(ВыбранныеЭлементы, ДопПараметры) Экспорт
	
	Если ВыбранныеЭлементы = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	Для Каждого Элемент Из ВыбранныеЭлементы Цикл

        НоваяСтрока = Объект.ПланГрафик.Добавить();

        НоваяСтрока.ЗаданиеИПР = Элемент;
        НоваяСтрока.ПлановоеВремя = ПолучитьЗначениеРеквизита(Элемент, "ПлановыйТайминг");
        НоваяСтрока.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.НеПриступалКЗаданию");

    КонецЦикла;
   
КонецПроцедуры  


&НаКлиенте
Процедура СортироватьПоБлоку()
	
	Объект.ПланГрафик.Сортировать("Блок Возр"); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБлокиПланГрафика()
    
    Для каждого Строка Из Объект.ПланГрафик Цикл
        
        Если ЗначениеЗаполнено(Строка.ЗаданиеИПР) И ЗначениеЗаполнено(Строка.ЗаданиеИПР.Родитель) Тогда
            Строка.Блок = Строка.ЗаданиеИПР.Родитель;
        Иначе
            Строка.Блок = Справочники.ЗадачиИПР.ПустаяСсылка();
        КонецЕсли;
        
    КонецЦикла;
    
    // Далее можно отсортировать табличную часть
    Объект.ПланГрафик.Сортировать("Блок Возр");
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьБлокиПланГрафика();
КонецПроцедуры
