// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПредопределенныеОтветыБота() Экспорт
	
	ПредопределенныеОтветы = ИнициализироватьПредопределенныеОтветыБота();
	
	МетаданныеПеречисление = Метаданные.Перечисления.ТипыПредопределенныхОтветовБота;
	ПеречислениеМенеджер = Перечисления.ТипыПредопределенныхОтветовБота;
	
	Для Каждого ПеречислениеЭлемент Из МетаданныеПеречисление.ЗначенияПеречисления Цикл
		
		ПеречислениеСсылка = ПеречислениеМенеджер[ПеречислениеЭлемент.Имя];
		
		НовыйОтвет = ПредопределенныеОтветы.Добавить();
		НовыйОтвет.ТипОтвета	= ПеречислениеСсылка;
		
		Если ПеречислениеСсылка = ПеречислениеМенеджер.ВыборВариантаАвторизации Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Пожалуйста, выберите вариант авторизации в системе'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится пользователю при первичном входе в бота для выбора варианта авторизации'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ЗапросТелефона Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Пожалуйста, укажите свою телефон для аутентификации в системе'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится пользователю при первичном входе в бота для проверки наличия его пользователя в базе'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ЗапросПочты Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Пожалуйста, укажите свою почту для аутентификации в системе'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится пользователю при первичном входе в бота для проверки наличия его пользователя в базе'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ОповещениеОПодтверждении Тогда
			НовыйОтвет.Значение = НСтр("ru = 'На указанный вами %1 ""%2"" отправлен код подтверждения. Пожалуйста, введите его'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Текст сообщения, сопровождающий письмо или СМС подтверждения авторизации
			|Параметры:
			|    1) Вариант авторизации: либо почтовый ящик, либо телефон
			|    1) Почта или телефон, указанный пользователем'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ТекстПодтвержденияАвторизации Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Код подтверждения авторизации - %1. Отправьте его боту'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Сопровождающее сообщение, отправляемое пользователю при подтверждения авторизации на телефон или почту
			|Параметры:
			|    1) Код подтверждения авторизации'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.НекорректныйКод Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Код подтверждения введен некорректно'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится пользователю, если код проверки авторизации заполнен некорректно'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ЗапросФИО Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Вы еще не зарегистрированы с системе. Введите свое ФИО полностью'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится пользователю при первичном входе в бота, если он не зарегистрирован в системе'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ОжиданиеРегистрации Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Запрос на регистрацию поступил в систему. Ожидайте ответа'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится пользователю при начале регистрации после ввода ФИО'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ОповещениеОтветственныхОНовом Тогда
			НовыйОтвет.Значение = НСтр("ru = 'В систему поступил запрос на регистрацию от пользователя:
			| - ФИО: %1
			| - Идентификатор чата: %2'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится ответственным за регистрацию пользователям в боте при запросе нового пользователя зарегистрироваться в системе
			|Параметры:
			|    1) ФИО регистрируемого сотрудника;
			|    2) идентификатор чата, из которого сотрудник обращается к боту'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ОповещениеОтветственныхОбОкончании Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Регистрация пользователя %1 была подтверждена %2. Иных действий в системе не требуется'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится ответственным за регистрацию пользователям, если один из ответственных уже выполнил подтверждение регистрации
			|Параметры:
			|    1) ФИО зарегистрированного сотрудника;
			|    2) ФИО ответственного, выполнившего регистрацию'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.НедоступностьФункционала Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Функционал недоступен. Ожидайте сообщения о принятии регистрации в системе'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится пользователю при ожидании принятия регистрации'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ОкончаниеРегистрации Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Регистрация прошла успешно. Для начала работы, воспользуйтесь командой ""/start""'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится пользователю после регистрации в системе'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ТекстОтвета Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Вам пришел ответ от %1:'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится перед сообщением ответа пользователя на ваше сообщение
			|Параметры:
			|    1) ФИО пользователя, выполнившего ответ на сообщение'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ТекстПодсказкиОтвета Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Используйте ответить (reply), чтобы ваше сообщение увидел собеседник'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится после сообщения ответа пользователя для напоминания использования функции ""ответить""'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.КомандаНедоступнаВInlineMode Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Команда не предназначена для выполнения в режиме inline-mode'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится при использовании команды в режиме inline-mode, если команда не преднозначена для режима'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ТекстОповещенияНачалоВидеоЧата Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Начат видео-чат в группе %1.
			|Ссылка для перехода в группу: %2'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится при начале видео-чата, если пользователь подписан на оповещения
			|Параметры:
			|    1) Наименование группы, где начался видео-чат
			|    2) Ссылка для перехода в группу'");
			
		ИначеЕсли ПеречислениеСсылка = ПеречислениеМенеджер.ТекстОповещенияКонецВидеоЧата Тогда
			НовыйОтвет.Значение = НСтр("ru = 'Видео-чат в группе %1 окончен'");
			
			НовыйОтвет.Описание = НСтр("ru = 'Выводится после окончания видео-чата, если пользователь подписан на оповещения
			|Параметры:
			|    1) Наименование группы, где закончился видео-чат'");
			
		Иначе
			НовыйОтвет.Значение = "Заполните самостоятельно";
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПредопределенныеОтветы;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьПредопределенныеОтветыБота()
	
	ПредопределенныеОтветы = Новый ТаблицаЗначений;
	ПредопределенныеОтветы.Колонки.Добавить("ТипОтвета");
	ПредопределенныеОтветы.Колонки.Добавить("Значение");
	ПредопределенныеОтветы.Колонки.Добавить("Описание");
	
	Возврат ПредопределенныеОтветы;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли