// @strict-types

#Область ПрограммныйИнтерфейс

//Длительность хранения ошибок интеграции на месяц дольше, чем успешных записей
Процедура ОчисткаИсторииИнтеграции() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОчисткаИсторииИнтеграции);
	Справочники.ИсторияИнтеграции.ОчиститьИсториюИнтеграции();
	
КонецПроцедуры

// Выполнить интеграцию с jira.
// 
// Параметры:
//  НастройкиИнтеграцииСJiraСсылка - СправочникСсылка.НастройкиИнтеграцииСJira - ссылка на текущую настройку интеграции
Процедура ВыполнитьИнтеграциюСJira(НастройкиИнтеграцииСJiraСсылка) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ИнтеграцияСJira);
	ИнтеграцияСJiraСервер.ВыполнитьИнтеграциюСJiraПоРасписанию(НастройкиИнтеграцииСJiraСсылка);
	
КонецПроцедуры

Процедура СозданиеКадровыхПривлеченийНаПроектПоДаннымИзВнешнихСистем() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.СозданиеКадровыхПривлеченийНаПроектПоДаннымИзВнешнихСистем);
	
	КадровыйУчетСервер.ВыполнитьСозданиеКадровыхПривлеченийНаПроектПоДаннымВнешнихСистем();
	
КонецПроцедуры

// Выполнить задание бота.
// 
// Параметры:
//  ЗаданиеБотаСсылка - СправочникСсылка.ЗаданияБотов - ссылка на текущую настройку задания
Процедура ВыполнитьЗаданиеБота(ЗаданиеБотаСсылка) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВыполнениеЗаданийБотов);
	ИнтеграцияСБотамиСервер.ВыполнитьЗаданиеБота(ЗаданиеБотаСсылка);
	
КонецПроцедуры

// Получить обновления ботов.
// 
// Параметры:
//  БотСсылка - СправочникСсылка.Боты - Бот ссылка
Процедура ПолучитьОбновленияБотов(БотСсылка) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПолучениеОбновленийБотов);
	ИнтеграцияСБотамиСервер.ПолучитьОбновленияБотовРегламентноеЗадание(БотСсылка);
	
КонецПроцедуры

Процедура ОчисткаСообщенийПользователейБотов() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОчисткаСообщенийПользователейБотов);
	РегистрыСведений.СообщенияПользователейБотов.ОчиститьПоРасписанию();
	
КонецПроцедуры

Процедура ОчисткаВыполненияЗаданийБотов() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОчисткаВыполненияЗаданийБотов);
	РегистрыСведений.ВыполнениеЗаданийБотов.ОчиститьПоРасписанию();
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс