// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Офисы.Ссылка КАК Офис
	|ИЗ
	|	Справочник.Офисы КАК Офисы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Офисы.Наименование";
	
	ВыгрузкаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	Если ВыгрузкаРезультатаЗапроса.Количество() Тогда
		ОфисыСсылка = ВыгрузкаРезультатаЗапроса.ВыгрузитьКолонку("Офис");
	Иначе
		ОфисыСсылка = Новый Массив;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", 
		ОфисыСсылка, ВидСравненияКомпоновкиДанных.ВСписке, "Офисы", Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	КлючеваяОперация = "СозданиеФормыОтделыФормаЭлемента";
	
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);

КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	КлючеваяОперация = "СозданиеФормыОтделыФормаЭлемента";
	
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
КонецПроцедуры

#КонецОбласти
