&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		РасчетКоличестваДнейОтпуска();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейОтпускаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаОкончания = Объект.ДатаНачала + (КоличествоДнейОтпуска - 1) * 86400;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		РасчетКоличестваДнейОтпуска();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		РасчетКоличестваДнейОтпуска();
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура РасчетКоличестваДнейОтпуска()
	
	КоличествоДнейОтпуска = 1 + (Объект.ДатаОкончания - Объект.ДатаНачала) / 86400;
	
КонецПроцедуры

