#Область ПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);	
	
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента();
	Результат = Запрос.Выполнить();
	
	ТаблицаРеквизиты = Результат.Выгрузить();
	Реквизиты        = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаРеквизитыДокумента()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПланированиеОтпуска.Ссылка КАК Ссылка,
	|	ПланированиеОтпуска.Номер КАК Номер,
	|	ПланированиеОтпуска.Дата КАК Дата,
	|	ПланированиеОтпуска.ПометкаУдаления КАК ПометкаУдаления,
	|	ПланированиеОтпуска.Проведен КАК Проведен,
	|	ПланированиеОтпуска.Сотрудник КАК Сотрудник,
	|	ПланированиеОтпуска.ДатаНачала КАК ДатаНачала,
	|	ПланированиеОтпуска.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.ПланированиеОтпуска КАК ПланированиеОтпуска
	|ГДЕ
	|	ПланированиеОтпуска.Ссылка = &Ссылка";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции