
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ДатаНачала > ДатаОкончания Тогда
		ОбщегоНазначения.СообщитьПользователю("Дата начала отпуска не может быть позже, чем дата окончания");
		Отказ = Истина;
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПараметрыПроведения = Документы.ПланированиеОтпуска.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыПроведения.Свойство("Реквизиты") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента	= ПараметрыПроведения.Реквизиты;
	
	Движения.ОтпускаСотрудников.Очистить();
	
	Для Каждого ЗаписьОтпуска Из РеквизитыДокумента Цикл
		
		НоваяЗапись = Движения.ОтпускаСотрудников.Добавить();
		НоваяЗапись.Период = ЗаписьОтпуска.Дата;
		НоваяЗапись.Сотрудник = ЗаписьОтпуска.Сотрудник;
		НоваяЗапись.ДатаНачала = ЗаписьОтпуска.ДатаНачала;
		НоваяЗапись.ДатаОкончания = ЗаписьОтпуска.ДатаОкончания;
		
	КонецЦикла;
	
	Движения.ОтпускаСотрудников.Записывать = Истина;
	
КонецПроцедуры 

#КонецОбласти // ОбработчикиСобытий
