


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ТипЗнч(ВыбраннаяСтрока) = Тип("Массив") Тогда
		Для Каждого СтрокаСсылка Из ВыбраннаяСтрока Цикл
			НайденныеСтроки = Корзина.НайтиСтроки(Новый Структура("ЗаданиеИПР", СтрокаСсылка));
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = Корзина.Добавить();
				НоваяСтрока.ЗаданиеИПР = СтрокаСсылка;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	МассивСсылок = Новый Массив;
	
	Для Каждого Стр Из Корзина Цикл
		МассивСсылок.Добавить(Стр.ЗаданиеИПР);
	КонецЦикла;
	
	ОповеститьОВыборе(МассивСсылок);
    Закрыть(МассивСсылок);
	
КонецПроцедуры


&НаКлиенте
Процедура КорзинаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
    
    Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
        Для каждого СтрокаПеретаскивания Из ПараметрыПеретаскивания.Значение Цикл
            
			НайденныеСтроки = Корзина.НайтиСтроки(Новый Структура("ЗаданиеИПР", СтрокаПеретаскивания));

            Если НайденныеСтроки.Количество() = 0  Тогда
                НоваяСтрока = Корзина.Добавить();
                НоваяСтрока.ЗаданиеИПР = СтрокаПеретаскивания;
            КонецЕсли;
        КонецЦикла;
	КонецЕсли;

КонецПроцедуры
