
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ДобавитьВКорзину(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	МассивСсылок = Новый Массив;
	
	Для Каждого Стр Из Корзина Цикл
		МассивСсылок.Добавить(Стр.ЗаданиеИПР);
	КонецЦикла;
	
	ОповеститьОВыборе(МассивСсылок);
    Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
    
    ДобавитьВКорзину(ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры   

&НаКлиенте
Процедура ДобавитьВКорзину(Знач Выбор)
    Если ТипЗнч(Выбор) = Тип("Массив") Тогда
        Для Каждого СтрДокумент Из Выбор Цикл
            Если ЗначениеЗаполнено(СтрДокумент)
               И ТипЗнч(СтрДокумент) = Тип("СправочникСсылка.ЗадачиИПР")
               И Не СтрДокумент.ЭтоГруппа Тогда
                Если Корзина.НайтиСтроки(Новый Структура("ЗаданиеИПР", СтрДокумент)).Количество() = 0 Тогда
                    НоваяСтрока = Корзина.Добавить();
                    НоваяСтрока.ЗаданиеИПР = СтрДокумент;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
    ИначеЕсли ЗначениеЗаполнено(Выбор)
       И ТипЗнч(Выбор) = Тип("СправочникСсылка.ЗадачиИПР")
       И Не Выбор.ЭтоГруппа Тогда
        Если Корзина.НайтиСтроки(Новый Структура("ЗаданиеИПР", Выбор)).Количество() = 0 Тогда
            НоваяСтрока = Корзина.Добавить();
            НоваяСтрока.ЗаданиеИПР = Выбор;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
