
Процедура ПриКопировании(ОбъектКопирования)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИндивидуальныйПланРазвитияПланГрафик.ЗаданиеИПР КАК ЗаданиеИПР,
		|	ИндивидуальныйПланРазвитияПланГрафик.Статус КАК Статус,
		|	ИндивидуальныйПланРазвитияПланГрафик.ДатаНачала КАК ДатаНачала,
		|	ИндивидуальныйПланРазвитияПланГрафик.ПлановоеВремя КАК ПлановоеВремя,
		|	ИндивидуальныйПланРазвитияПланГрафик.ФактическоеВремя КАК ФактическоеВремя,
		|	ИндивидуальныйПланРазвитияПланГрафик.Комментарий КАК Комментарий,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Сотрудник КАК Сотрудник,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.ДатаНачала КАК ДатаНачала1,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.ДатаОкончания КАК ДатаОкончания,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Наставник КАК Наставник,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Должность КАК Должность,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Дата КАК Дата,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИндивидуальныйПланРазвития.ПланГрафик КАК ИндивидуальныйПланРазвитияПланГрафик
		|ГДЕ
		|	НЕ ИндивидуальныйПланРазвитияПланГрафик.Статус В (&Статус)
		|	И ИндивидуальныйПланРазвитияПланГрафик.Ссылка = &Ссылка";
	
	СтатусыКИсключению = Новый Массив; 
	СтатусыКИсключению.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоНеудовлетворительно"));
	СтатусыКИсключению.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоУдовлетворительно"));
	Запрос.УстановитьПараметр("Ссылка", ОбъектКопирования.Ссылка);
	Запрос.УстановитьПараметр("Статус", СтатусыКИсключению);

	ОбъектКопирования = Неопределено;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ВыборкаДетальныеЗаписи); 
		ЭтотОбъект.Дата = Неопределено; 
		ЭтотОбъект.ДатаОкончания = Неопределено; 
		ЭтотОбъект.ДатаНачала = ТекущаяДата();
        ЭтотОбъект.ПланГрафик.Очистить();
		
		ВыборкаДетальныеЗаписи.Сбросить();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовСтрока = ЭтотОбъект.ПланГрафик.Добавить();
		    ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
    Движения.ВыполнениеЗаданийИПР.Очистить();
	Движения.ВыполнениеЗаданийИПР.Записывать = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка.Сотрудник КАК Сотрудник,
		|	ИндивидуальныйПланРазвитияПланГрафик.ЗаданиеИПР КАК ЗаданиеИПР,
		|	ИндивидуальныйПланРазвитияПланГрафик.ФактическоеВремя КАК ФактическоеВремя
		|ИЗ
		|	Документ.ИндивидуальныйПланРазвития.ПланГрафик КАК ИндивидуальныйПланРазвитияПланГрафик
		|ГДЕ
		|	НЕ ИндивидуальныйПланРазвитияПланГрафик.Статус В (&Статус)
		|	И ИндивидуальныйПланРазвитияПланГрафик.Ссылка = &Ссылка";

	СтатусыКИсключению = Новый Массив; 
	СтатусыКИсключению.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоНеудовлетворительно"));
	СтатусыКИсключению.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗадачИПР.ЗаданиеВыполненоУдовлетворительно"));
	Запрос.УстановитьПараметр("Статус", СтатусыКИсключению);   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВыполнениеЗаданийИПР.Добавить();
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник; 
		Движение.Задание = ВыборкаДетальныеЗаписи.ЗаданиеИПР;
		Движение.Время = ВыборкаДетальныеЗаписи.ФактическоеВремя;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИндивидуальныйПланРазвитияПланГрафик.ЗаданиеИПР) КАК ЗаданиеИПРРазные,
		|	КОЛИЧЕСТВО(ИндивидуальныйПланРазвитияПланГрафик.ЗаданиеИПР) КАК ЗаданиеИПРВсего,
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИндивидуальныйПланРазвития.ПланГрафик КАК ИндивидуальныйПланРазвитияПланГрафик
		|ГДЕ
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ИндивидуальныйПланРазвитияПланГрафик.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.ЗаданиеИПРРазные <> ВыборкаДетальныеЗаписи.ЗаданиеИПРВсего Тогда  
			Отказ = Истина;
			Сообщить("Задания в документе не должны дублироваться");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
