
&НаКлиенте
Процедура ОткрытьСсылку(Команда)
	ОткрытьСсылкуВБраузере();
КонецПроцедуры  

&НаСервере
Процедура ОткрытьСсылкуВБраузере()   
	
    Гиперссылка = Объект.Гиперссылка;
	
    Если ПустаяСтрока(Объект.Гиперссылка) Тогда
        ОбщегоНазначения.СообщитьПользователю("Ссылка не указана.");
		Возврат;
	КонецЕсли;
	
	Лок = НРег(Гиперссылка);  
	
	Если НЕ СтрНачинаетсяС(Лок, "http://") И НЕ СтрНачинаетсяС(Лок, "https://") Тогда
		Гиперссылка = "https://" + Гиперссылка;
	КонецЕсли;  
	
	Попытка
		
		ЗапуститьПриложение(Гиперссылка); 
		// Игнорирую замечания Rabbit тут, не существует процедуры ОткрытьВнешнююСсылку
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось открыть ссылку: " + ОписаниеОшибки());
   КонецПопытки;
   
КонецПроцедуры
