
&НаКлиенте
Процедура ОткрытьСсылку(Команда)
	ОткрытьСсылкуВБраузере();
КонецПроцедуры  

&НаСервере
Процедура ОткрытьСсылкуВБраузере()   
	
    Гиперссылка = Объект.Гиперссылка;
	
    Если ПустаяСтрока(Объект.Гиперссылка) Тогда
        ОбщегоНазначения.СообщитьПользователю("Ссылка не указана.");
        Возврат;
	КонецЕсли;
	
    Если НЕ СтрНайти(Гиперссылка, "http") Тогда
        Гиперссылка = "https://" + Гиперссылка;
	КонецЕсли;
	
    Попытка
        ЗапуститьПриложение(Гиперссылка);
    Исключение
        ОбщегоНазначения.СообщитьПользователю("Не удалось открыть ссылку: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры
