
&НаКлиенте
Процедура ПодборКомпетенций(Команда)
	
	ПодборОбщее(ПредопределенноеЗначение("Перечисление.ТипыКомпетенций.Универсальные"), "ПодборКомпетенцийЛичные");
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодборКомпетенцийТехнические(Команда)
	
	ПодборОбщее(ПредопределенноеЗначение("Перечисление.ТипыКомпетенций.Профессиональные"), "ПодборКомпетенцийТехнические");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомпетенцийФункциональные(Команда)
	
	ПодборОбщее(ПредопределенноеЗначение("Перечисление.ТипыКомпетенций.Обязанность"), "ПодборКомпетенцийФункциональные");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОбщее(ТипКомпетенции, ПараметрПодбора)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипКомпетенции", ТипКомпетенции);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма, ПараметрПодбора);
	
	ОткрытьФорму("Справочник.Компетенции.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработкаВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
	
	ЗакрытиеФормыВыбораНаСервере(Значение, ДопПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытиеФормыВыбораНаСервере(Значение, ДопПараметры)
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры = "ПодборКомпетенцийЛичные" Тогда
		Для Каждого ЭлементМассива Из Значение Цикл
			НоваяСтрока = Объект.ЛичныеНавыки.Добавить();
			НоваяСтрока.Навык = ЭлементМассива;
		КонецЦикла;
		
	ИначеЕсли ДопПараметры = "ПодборКомпетенцийФункциональные" Тогда
		Для Каждого ЭлементМассива Из Значение Цикл 
			НоваяСтрока = Объект.ФункциональныеОбязанности.Добавить();
			НоваяСтрока.Обязанность = ЭлементМассива;
		КонецЦикла;
		
	ИначеЕсли ДопПараметры = "ПодборКомпетенцийТехнические" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Компетенция.Ссылка КАК Навык,
		|	Компетенция.Родитель КАК Родитель
		|ИЗ
		|	Справочник.Компетенции КАК Компетенция
		|ГДЕ
		|	Компетенция.Ссылка В(&Ссылка)";
		Запрос.УстановитьПараметр("Ссылка", Значение);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДанныеДерева = РеквизитФормыВЗначение("ТехническиеНавыкиДерево");
		Пока Выборка.Следующий() Цикл
			НовыйРодитель = ДанныеДерева.Строки.Найти(Выборка.Родитель);
			Если НовыйРодитель = Неопределено Тогда
				НовыйРодитель = ДанныеДерева.Строки.Добавить();
				НовыйРодитель.Навык = Выборка.Родитель;
			КонецЕсли;
			Навыки = НовыйРодитель.Строки.Добавить();
			Навыки.Навык = Выборка.Навык;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ДанныеДерева, "ТехническиеНавыкиДерево");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеДерева = РеквизитФормыВЗначение("ТехническиеНавыкиДерево");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Компетенции.Родитель КАК Родитель,
	|	ПрофилиДолжностейТехническиеНавыки.Навык КАК Навык
	|ИЗ
	|	Справочник.ПрофилиДолжностей.ТехническиеНавыки КАК ПрофилиДолжностейТехническиеНавыки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Компетенции КАК Компетенции
	|		ПО ПрофилиДолжностейТехническиеНавыки.Навык = Компетенции.Ссылка
	|ГДЕ
	|	ПрофилиДолжностейТехническиеНавыки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовыйРодитель = ДанныеДерева.Строки.Найти(Выборка.Родитель);
		Если НовыйРодитель = Неопределено Тогда
			НовыйРодитель = ДанныеДерева.Строки.Добавить();
			НовыйРодитель.Навык = Выборка.Родитель;
		КонецЕсли;
		Навыки = НовыйРодитель.Строки.Добавить();
		Навыки.Навык = Выборка.Навык;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДанныеДерева, "ТехническиеНавыкиДерево");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДанныеДерева = РеквизитФормыВЗначение("ТехническиеНавыкиДерево");
	ТекущийОбъект.ТехническиеНавыки.Очистить();
	
	Для Каждого СтрокаВерхИерархии Из ДанныеДерева.Строки Цикл
		Для Каждого СтрокаНижИерархии Из СтрокаВерхИерархии.Строки Цикл
			НовыйЭлемент = ТекущийОбъект.ТехническиеНавыки.Добавить();
			НовыйЭлемент.Навык = СтрокаНижИерархии.Навык;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры