// ++ префикс DRKhamidullin@1cbit.ru 26.05.2025 [Код задачи]
// Добавление подбора компетенций
&НаКлиенте
Процедура ПодборКомпетенций(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипКомпетенции", ПредопределенноеЗначение("Перечисление.ТипыКомпетенций.Универсальные"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма, "ПодборКомпетенцийЛичные");
	
	ОткрытьФорму("Справочник.Компетенции.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработкаВыбора);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодборКомпетенцийТехнические(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипКомпетенции", ПредопределенноеЗначение("Перечисление.ТипыКомпетенций.Профессиональные"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма, "ПодборКомпетенцийТехнические");
	
	ОткрытьФорму("Справочник.Компетенции.ФормаВыбора", ПараметрыФормы,	ЭтаФорма, , , , ОбработкаВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомпетенцийФункциональные(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипКомпетенции", ПредопределенноеЗначение("Перечисление.ТипыКомпетенций.Обязанность"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма, "ПодборКомпетенцийФункциональные");
	
	ОткрытьФорму("Справочник.Компетенции.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработкаВыбора);
	
КонецПроцедуры

&НаСервере  
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры = "ПодборКомпетенцийЛичные" Тогда
		Для Каждого ЭлементМассива Из Значение Цикл
			НоваяСтрока = Объект.ЛичныеНавыки.Добавить();
			НоваяСтрока.Навык = ЭлементМассива;
		КонецЦикла;
		
	ИначеЕсли ДопПараметры = "ПодборКомпетенцийФункциональные" Тогда
		Для Каждого ЭлементМассива Из Значение Цикл 
			НоваяСтрока = Объект.ФункциональныеОбязанности.Добавить();
			НоваяСтрока.Обязанность = ЭлементМассива;
		КонецЦикла;
		
	ИначеЕсли ДопПараметры = "ПодборКомпетенцийТехнические" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Компетенция.Ссылка КАК Навык,
		|	Компетенция.Родитель КАК РодительЭлемента
		|ИЗ
		|	Справочник.Компетенции КАК Компетенция
		|ГДЕ
		|	Компетенция.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Родитель";
		Запрос.УстановитьПараметр("Ссылка", Значение);
		ПромДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ОбходДереваДетально(ПромДерево);
		ЗначениеВРеквизитФормы(ПромДерево, "ТехническиеНавыкиДерево");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбходДереваДетально(ПереданноеДер)
	
	Для Каждого СтрПолученногоДерева Из ПереданноеДер.Строки Цикл
		Если НЕ ТипЗнч(СтрПолученногоДерева.Навык) <> Тип("СправочникСсылка.Компетенции") Тогда
			СтрПолученногоДерева.РодительЭлемента = Справочники.Компетенции.ПустаяСсылка();
		КонецЕсли;
		
		Если СтрПолученногоДерева.Строки.Количество()>0 Тогда
			ОбходДереваДетально(СтрПолученногоДерева);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Дерево = ТекущийОбъект.ХранилищеЗначенияДерева.Получить();
	
	Если Дерево <> Неопределено Тогда
		ЗначениеВРеквизитФормы(Дерево, "ТехническиеНавыкиДерево");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Дерево = РеквизитФормыВЗначение("ТехническиеНавыкиДерево");
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ХранилищеЗначенияДерева = Новый ХранилищеЗначения(Дерево);
	ТекущийОбъект.Записать();
	
КонецПроцедуры
// -- префикс DRKhamidullin@1cbit.ru 26.05.2025 [Код задачи]
