
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ЗначениеЗаполнено(Период.ДатаНачала) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		СформироватьНаСервере(); 
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен период");
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура СформироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ОтпускаСотрудников КАК ОтпускаСотрудников
	|ГДЕ
	|	ОтпускаСотрудников.ДатаНачала <= &КонецПериода
	|	И ОтпускаСотрудников.ДатаОкончания >= &НачалоПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	ДиаграммаГанта.ОтображатьЛегенду = Ложь;
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(Период.ДатаНачала, Период.ДатаОкончания);
	
	Серия = ДиаграммаГанта.Серии.Добавить();
	Серия.Текст = "Отпуск";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		ЗначениеДГ = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = ЗначениеДГ.Добавить();
		Интервал.Начало = ВыборкаДетальныеЗаписи.ДатаНачала;
		Интервал.Конец = КонецДня(ВыборкаДетальныеЗаписи.ДатаОкончания);
		
	КонецЦикла;
	
КонецПроцедуры
