
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры 

&НаСервере
Процедура СформироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ОтпускаСотрудников КАК ОтпускаСотрудников
	|ГДЕ
	|	ОтпускаСотрудников.ДатаНачала МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать(); 
	
	ДиаграммаГанта.ОтображатьЛегенду = Ложь; 
	ДиаграммаГанта.Очистить();
	Серия = ДиаграммаГанта.Серии.Добавить();
	Серия.Текст = "Отпуск";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		ЗначениеДГ = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = ЗначениеДГ.Добавить();
		Интервал.Начало = ВыборкаДетальныеЗаписи.ДатаНачала;
		Интервал.Конец = КонецДня(ВыборкаДетальныеЗаписи.ДатаОкончания);
		
	КонецЦикла;
		
КонецПроцедуры
